dependencies/multiRegionFoam/tutorials/multiRegionPlateFin/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

/* Core 105 (Shah and London, 1967, London and Shah, 1968)
   Aluminum alloy fin, with air as heat transfer fluid
   l = length		x (stream-wise) direction
   p = pitch		y (vertical cross-wise) direction
   b = module width	z (horizontal cross-wise) direction
   d = fin thickness
*/
b  1.905e-03;
p  1.054e-03;
l  2.833e-03;
d  0.1016e-03;

x0 0;
x1 $l;
x2 #calc "2.0*$l";
y0 0;
y1 #calc "0.5*$d";
y2 #calc "0.5*($p-$d)";
y3 #calc "0.5*$p";
z0 0;
z1 $d;
z2 #calc "$b-$d";
z3 $b;

vertices
(

// West fin

    ($x0  $y0  $z0)//0
    ($x1  $y0  $z0)//1
    ($x1  $y1  $z0)//2
    ($x0  $y1  $z0)//3
    ($x0  $y0  $z1)//4
    ($x1  $y0  $z1)//5
    ($x1  $y1  $z1)//6
    ($x0  $y1  $z1)//7
    ($x0  $y0  $z2)//8
    ($x1  $y0  $z2)//9
    ($x1  $y1  $z2)//10
    ($x0  $y1  $z2)//11
    ($x0  $y0  $z3)//12
    ($x1  $y0  $z3)//13
    ($x1  $y1  $z3)//14 
    ($x0  $y1  $z3)//15
    ($x1  $y2  $z0)//16
    ($x0  $y2  $z0)//17
    ($x1  $y2  $z1)//18 
    ($x0  $y2  $z1)//19
    ($x1  $y2  $z2)//20 
    ($x0  $y2  $z2)//21
    ($x1  $y2  $z3)//22 
    ($x0  $y2  $z3)//23
    ($x1  $y3  $z0)//24
    ($x0  $y3  $z0)//25
    ($x1  $y3  $z1)//26 
    ($x0  $y3  $z1)//27
    ($x1  $y3  $z2)//28 
    ($x0  $y3  $z2)//29
    ($x1  $y3  $z3)//30 
    ($x0  $y3  $z3)//31

// East fin

    ($x2  $y0  $z0)//32
    ($x2  $y1  $z0)//33
    ($x2  $y0  $z1)//34
    ($x2  $y1  $z1)//35
    ($x2  $y0  $z2)//36
    ($x2  $y1  $z2)//37
    ($x2  $y0  $z3)//38
    ($x2  $y1  $z3)//39
    ($x2  $y2  $z0)//40
    ($x2  $y2  $z1)//41 
    ($x2  $y2  $z2)//42 
    ($x2  $y2  $z3)//43 
    ($x2  $y3  $z0)//44
    ($x2  $y3  $z1)//45 
    ($x2  $y3  $z2)//46 
    ($x2  $y3  $z3)//47 

);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) (20 2 4) simpleGrading (1 1 1)
    hex ( 4  5  6  7  8  9 10 11) (20 2 40) simpleGrading (1 1 1)
    hex ( 8  9 10 11 12 13 14 15) (20 2 4) simpleGrading (1 1 1)

    hex ( 3  2 16 17  7  6 18 19) (20 5 4) simpleGrading (1 1 1)
    hex ( 7  6 18 19 11 10 20 21) (20 5 40) simpleGrading (1 1 1)
    hex (11 10 20 21 15 14 22 23) (20 5 4) simpleGrading (1 1 1)

    hex (17 16 24 25 19 18 26 27) (20 2 4) simpleGrading (1 1 1)
    hex (19 18 26 27 21 20 28 29) (20 2 40) simpleGrading (1 1 1)
    hex (21 20 28 29 23 22 30 31) (20 2 4) simpleGrading (1 1 1)


    hex ( 1 32 33  2  5 34 35  6) (20 2 4) simpleGrading (1 1 1)
    hex ( 5 34 35  6  9 36 37 10) (20 2 40) simpleGrading (1 1 1)
    hex ( 9 36 37 10 13 38 39 14) (20 2 4) simpleGrading (1 1 1)
 
    hex ( 2 33 40 16 6 35 41 18)  (20 5 4) simpleGrading (1 1 1)
    hex ( 6 35 41 18 10 37 42 20) (20 5 40) simpleGrading (1 1 1)
    hex (10 37 42 20 14 39 43 22) (20 5 4) simpleGrading (1 1 1)

    hex (16 40 44 24 18 41 45 26) (20 2 4) simpleGrading (1 1 1)
    hex (18 41 45 26 20 42 46 28) (20 2 40) simpleGrading (1 1 1)
    hex (20 42 46 28 22 43 47 30) (20 2 4) simpleGrading (1 1 1)

);

edges
(
);

patches
(

 patch Wall
(
// Solid
// Low East (z-plate)
    (0 3 2 1) 
    (3 17 16 2) 
    (17 25 24 16)  
// High West (z-plate)
    (14 13 38 39)
    (22 14 39 43)
    (30 22 43 47)

    (16 24 44 40) 
    (15 12 13 14)

// Fluid
// High West (z-plane)
    (1 2 33 32) 
    (2 16 40 33) 
// Low East (z-plane)
    (23 15 14 22)
    (31 23 22 30)
)

 patch Symmetry
( 
// Solid
// South West (y-plane)
    (0 1 5 4) 
    (4 5 9 8) 
    (8 9 13 12)  
// North East (y-plane)
    (24 26 45 44)
    (26 28 46 45)
    (28 30 47 46)    
// North West (y-plane)
    (25 27 26 24) 
// South East (y-plane)
    ( 9 13 38 36)

// Fluid
// North West (y-plane)
    (27 29 28 26) 
    (29 31 30 28)  
// South East (y-plane)
    ( 1  5 34 32)
    ( 5  9 36 34)
)
 patch In
( 
// Solid
    ( 0 4  7 3) 
    ( 4 8 11 7) 
    ( 8 12 15 11)  
    ( 3  7 19 17)
    (17 19 27 25)
// Fluid
    (7 11 21 19) 
    (11 15 23 21) 
    (19 21 29 27)  
    (21 23 31 29)
)

 patch Out
// Solid
(
    (40 44 45 41)
    (41 45 46 42)
    (42 46 47 43)
    (37 42 43 39) 
    (36 37 39 38) 

// Fluid
    (32 33 35 34) 
    (34 35 37 36) 
    (33 40 41 35)  
    (35 41 42 37)
)
);

mergePatchPairs
(
);

// ************************************************************************* //
