dependencies/multiRegionFoam/tutorials/multiRegionPlateFin/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

b  1.905e-03;
p  1.054e-03;
l  2.833e-03;
d  0.1016e-03;

x0 0;
x1 $l;
x2 #calc "2.0*$l";
y0 0;
y1 #calc "0.5*$d";
y2 #calc "0.5*($p-$d)";
y3 #calc "0.5*$p";
z0 0;
z1 $d;
z2 #calc "$b-$d";
z3 $b;


actions
(
    // solid
    {
        name    solidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box ($x0 $y0 $z0 )($x1 $y3 $z1);//Low fin
        }
    }
    {
        name    solidCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box ($x1 $y0 $z2 )($x2 $y3 $z3);//High fin
        }
    }
    {
        name    solidCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box ($x0 $y0 $z0 )($x1 $y1 $z3);//South fin
        }
    }
    {
        name    solidCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box ($x1 $y2 $z0 )($x2 $y3 $z3);//North fin
        }
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solidCellSet;
        }
    }
 // Fluid
     {
        name    fluidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box ($x0 $y1 $z1 )($x1 $y3 $z3);
        }
     }
     {
        name    fluidCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
            box ($x1 $y0 $z0 )($x2 $y2 $z2);
        }
     }
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set fluidCellSet;
        }
    }
);

// ************************************************************************* //
